--;; 菜单数据
INSERT INTO `t_sys_menu` VALUES
('1', '0', '1', '首页', 'home', '/main', 'home', 0, 0, '2019-11-25 00:00:00'),
('9', '0', '1', '系统管理', 'system', '', 'setting', 99, 0, '2019-11-25 00:00:00'),
('91', '9', '1', '系统用户列表', '', '/main/system/user', '', 1, 0, '2019-11-25 00:00:00'),
('92', '9', '1', '系统角色列表', '', '/main/system/role', '', 2, 0, '2019-11-25 00:00:00'),
('93', '9', '1', '系统菜单列表', '', '/main/system/menu', '', 3, 0, '2019-11-25 00:00:00'),
('94', '9', '1', '系统字典列表', '', '/main/system/dict', '', 4, 0, '2019-11-25 00:00:00');

--;; 角色数据
INSERT INTO `t_sys_role` VALUES ('1', '1', '管理员', 'admin', 0, '2019-11-25 00:00:00');

--;; 角色菜单数据
INSERT INTO `t_sys_role_menu` VALUES
('3f2541b59c854ae0b62da701b8ca4b6a', '1', '91'),
('8323645790754dcc8bed8ac9bd2e6457', '1', '9'),
('9cb6a2bbeb26427891f6ae4e66489496', '1', '94'),
('bf57c33a31f44c8db3da0f99c3f9f4f0', '1', '1'),
('c29b2f477105431bb958f343cd99b69e', '1', '92'),
('eeebf18f016142eaa5084f60ee15e4e5', '1', '93');


--;; 系统用户数据
INSERT INTO `t_sys_user` VALUES ('1', 'admin', '8c6976e5b5410415bde908bd4dee15dfb167a9c873fc4bb8a81f6f2ab448a918', '管理员', '1', '', '', '2019-11-25 00:00:00', '2019-11-25 00:00:00', 0),
('227093246612905984', 'redc', 'ca67804388c23ed961dc61bfc66e68e2f21aa61c190fb204e798b4cf4f16a59d', '红创优选', '2', '', '', '2019-11-25 00:00:00', '2019-11-25 00:00:00', 0);

--;; 系统用户角色关系数据
INSERT INTO `t_sys_user_role` VALUES ('962938280637104128', '1', '1');
